{"language":"Solidity","settings":{"libraries":{},"metadata":{"useLiteralContent":true},"optimizer":{"enabled":false,"runs":200},"remappings":[],"outputSelection":{"*":{"*":["*"],"":["*"]}}},"sources":{"browser/uKASH.sol":{"content":"\npragma solidity ^0.6.6;\n\n\n/*\nOWNER OF TOKEN: SAMUEL RICHARD PENN© TRUST\n\n             \n                                 NOTE\n             \n             \n\nThe original contract is signed, witnessed, sealed, stamped and held by the trustee of the SAMUEL RICHARD PENN© TRUST.\nThe token 08081986-SRP-CLC shall represent the certificate of title to the original bond. The holder in due course MUST possess the 08081986-SRP-CLC token to validate proof of claim.\nOriginal documents can be seen and copies requested on www.samuelrichardpenn.com,\nor on https://www.instagram.com/samuelrichardpenn/. Trustee can be reached at blackbloodestate@gmail.com.\nThis token may never be sold. It can only be passed from a trust to a beneficiary.\n\nLet the public be noticed of the following copyright.\n\nCopyright Notice: All rights reserved.\nCopyright  of  trade-name/trademark  SAMUEL  RICHARD  PENN©  TRUST  including  any  and  all  derivatives and variations in the spelling,\ni.e. NOT limited to all capitalized names: SAMUEL RICHARD PENN TRUST ©. PENN©, SRP©, SAMUEL PENN©, PENN SAMUEL SR©, SR PENN© \nor any derivatives thereof are under Copyright 2004. Said common-law trade-name/trademark, SAMUEL RICHARD PENN© \nTRUST may neither be used nor reproduced, neither  in  whole  nor  in  part,  in  any  manner  whatsoever, \nwithout  the  prior,  express,  written  consent  and acknowledgment of Trustee/Trust in writing. \nWith the Intent of being Contractually Bound, any Juristic Person, as well as the agent thereof, by notice of this copyright\nis noticed that neither said Juristic Person nor agent thereof is authorized to display, \nnor otherwise use in any manner, the common-law trade-name/trademark nor the copyright described herein,\nnor any derivative of, nor any variation  in  the  spelling  thereof, without  the  prior,  written  consent \nand  acknowledgment  of  Trustee/TRUST,  as signified in writing with signed consent. Trustee/Trust \nneither grants, nor implies, nor otherwise gives consent for any unauthorized use of SAMUEL RICHARD PENN©, \nand all such unauthorized use is strictly prohibited.\nBy receipt of this notice you are hereby made aware of this copyright if otherwise ignorant of the \nfact that said copyright is a matter of public record. This is notification that you are in BREACH. \nYou herein have two options for remedy of this breach of copyright:\n1)  You consent to the removal of information and discontinuation of use of all information held in copyright \nthat contains copyrighted materials from all databases publications, chronicles, \nmanifestos, newspapers, and/or records of any type and issue a written apology.; or\n2)  If the first option of this section is neither effected or arrangements to affect cure of \nbreach as described is not engaged within 10 days of return receipt of this Notice then the clause \nby default will be enacted and you consent to the following Self-executing Contract/Security \nAgreement in Event of Unauthorized Use as well as Payment Terms as described:\n\na)    Self-executing Contract/Security  Agreement in Event of Unauthorized Use: By this Notice, \nboth the Juristic Person and the agent thereof, hereinafter .jointly and severally \"User\", consent \nand agree that any use of trade-name/trademark copyright other than authorized use as set forth herein, constitutes unauthorized use and  counterfeiting  of  property,  contractually  binds  User \n and  renders  this  Notice  a  Security  Agreement wherein User is TRUST and SAMUEL RICHARD PENN TRUST© is Secured Party, and signifies that User:\nb)    In accordance with the fees for unauthorized use of Trade-Name/Trademark/Copyright, as set forth herein, consents to be invoiced for outstanding balance and agrees that User shall pay TRUST all unauthorized use fees in full within thirty (30) days of the date User is sent \"Invoice\", \nitemizing said fees.\nc)    Grants Trustee/TRUST the right to invoice three times at thirty day intervals at which time \nUser consents to the outstanding balance that will be filed as a lien/levy via a UCC Financing \nStatement in the UCC filing office and/or in any county recorder's office, wherein User is TRUST \nand Trustee is Secured Party and that Secured Party may file such lien/levy against property\n\n\nas a security interest in all of User's assets, land and personal property, and all of User's interest \nin assets, land and personal property, in the sum certain amount of $500,000.00 per each occurrence of use of the common-law copyrighted trade-name/trademark, plus costs, plus triple damages;\nd)    Consent and agrees that said UCC Financing Statement described in \"c\" is a continuing \nfinancing statement, and further consents and agrees with TRUSTS filing of any continuation \nstatement necessary for maintaining Secured  Party's  perfected  security  interest  in  all  of  \nUser's  property  and  interest  in  property  pledged  as collateral in this Security Agreement  \nand  described herein until  User's contractual  obligation theretofore incurred has been fully \nsatisfied;\ne)    Waives all defenses; Consents and agrees that any and all such filings described herein going without remedy are not, and may not be considered, bogus/frivolous and that User will not claim such a defense in regard.\nf)     Appoints  Secured  Party  as  Authorized  Representative  for  User,  effective  upon  \nUser's  default  re  User's contractual  obligations  in  favor  of  Secured  Obligation  as  set  \nforth  herein  granting  TRUST/Trustee  full authorization and power for engaging in any and all \nactions on behalf of User including, but not limited to, authentication of a  record  on behalf  of \n User as Secured  Party, at  Secured  Party's sole  discretion,  and as Secured Party deems \nappropriate, and User further consents and agrees that this appointment of Secured Party as \nAuthorized Representative for User, effective upon User's default, is irrevocable and coupled with a security interest.\nTerms of Strict Foreclosure: User's non-payment in full of all unauthorized use fees itemized in \nInvoice within said ninety  (90)  day  period  for  curing  default as  set  forth  within  \nauthorizes without  recourse Trustee/Secured  Party’s immediate non-judicial strict foreclosure on any and all remaining former property and interest in property,\nformerly pledged as collateral by User, now property of Secured Party, which is not in the possession of,\nnor otherwise disposed of by Secured Party upon expiration of said period. Samuel-Richard:  Penn,  Autograph \nCommon  Law  Copyright  2004.  Unauthorized  use  of  \"Samuel-Richard:  Penn\" incurs same unauthorized-use fees as\nthose associated with SAMUEL RICHARD PENN© TRUST, as set forth in the first paragraph of the first page.\n\n\n\n\n\n\n\n*/\n\n\n\n\ncontract Owned {\n    modifier onlyOwner() {\n        require(msg.sender==owner);\n        _;\n    }\n    address payable owner;\n    address payable newOwner;\n    function changeOwner(address payable _newOwner) public onlyOwner {\n        require(_newOwner!=address(0));\n        \n        newOwner = _newOwner;\n    }\n    function acceptOwnership() public {\n        if (msg.sender==newOwner) {\n            owner = newOwner;\n        }\n    }\n}\n\nabstract contract ERC20 {\n    uint256 public totalSupply;\n    function balanceOf(address _owner) view public virtual returns (uint256 balance);\n    function transfer(address _to, uint256 _value) public virtual returns (bool success);\n    function transferFrom(address _from, address _to, uint256 _value) public virtual returns (bool success);\n    function approve(address _spender, uint256 _value) public virtual returns (bool success);\n    function allowance(address _owner, address _spender) view public virtual returns (uint256 remaining);\n    event Transfer(address indexed _from, address indexed _to, uint256 _value);\n    event Approval(address indexed _owner, address indexed _spender, uint256 _value);\n}\n\ncontract Token is Owned,  ERC20 {\n    string public symbol;\n    string public name;\n    uint8 public decimals;\n    mapping (address=>uint256) balances;\n    mapping (address=>mapping (address=>uint256)) allowed;\n    \n    function balanceOf(address _owner) view public virtual override returns (uint256 balance) {return balances[_owner];}\n    \n    function transfer(address _to, uint256 _amount) public virtual override returns (bool success) {\n        require (balances[msg.sender]>=_amount&&_amount>0&&balances[_to]+_amount>balances[_to]);\n        balances[msg.sender]-=_amount;\n        balances[_to]+=_amount;\n        emit Transfer(msg.sender,_to,_amount);\n        return true;\n    }\n  \n    function transferFrom(address _from,address _to,uint256 _amount) public virtual override returns (bool success) {\n        require (balances[_from]>=_amount&&allowed[_from][msg.sender]>=_amount&&_amount>0&&balances[_to]+_amount>balances[_to]);\n        balances[_from]-=_amount;\n        allowed[_from][msg.sender]-=_amount;\n        balances[_to]+=_amount;\n        emit Transfer(_from, _to, _amount);\n        return true;\n    }\n  \n    function approve(address _spender, uint256 _amount) public virtual override returns (bool success) {\n        allowed[msg.sender][_spender]=_amount;\n        emit Approval(msg.sender, _spender, _amount);\n        return true;\n    }\n    \n    function allowance(address _owner, address _spender) view public virtual override returns (uint256 remaining) {\n      return allowed[_owner][_spender];\n    }\n}\n\ncontract SecurityToken is Token{\n    \n    constructor() public{\n        symbol = \"SRP\";\n        name = \"08081986-SRP-CLC\";\n        decimals = 0;\n        totalSupply = 1;\n        owner = msg.sender;\n        balances[owner] = totalSupply;\n    }\n    \n    receive () payable external {\n        require(msg.value>0);\n        owner.transfer(msg.value);\n    }\n}"}}}